import { IAdvertisement } from "./advertisement";

export interface IAccessories extends IAdvertisement {
  parts:
    | "Покрышки и Камеры"
    | "Колеса"
    | "Амортизаторы и Вилки"
    | "Переключатели"
    | "Седла"
    | "Тормоза"
    | "Рули и выносы"
    | "Звезды, шатуны и цепи"
    | "Педали"
    | "Рамы"
    | "Другое";
  accessoriesType:
    | "Шлемы, защита, очки"
    | "Фонари"
    | "Сумки и багажники"
    | "Инструменты и смазки"
    | "Замки и сигнализации"
    | "Компьютеры и GPS"
    | "Детские велокресла"
    | "Другое";
  condition: "На запчасти" | "Б/у" | "Новый";
}
